---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCData.CreateString(System.String)
source: html/5c980ee3-7647-0f3d-5a0d-24b43356997f.htm
---
# Autodesk.Revit.DB.IFC.IFCData.CreateString Method

Creates a string data object.

## Syntax (C#)
```csharp
public static IFCData CreateString(
	string value
)
```

## Parameters
- **value** (`System.String`) - The string value.

## Returns
The IFCData object.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null